Repository: Tencent-RTC/TUILiveKit
Catalog: iOS/Component/Barrage/Resources/Localized/TUIBarrageLocalized.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: Accept
zh_hans: 同意
zh_hant: 同意

source: Adjust the video link screen
zh_hans: 调整视频连麦画面
zh_hant: 調整視頻連麥畫面

source: Agree
zh_hans: 同意
zh_hant: 同意

source: All Members Muted in the Current Room
zh_hans: 当前房间已开启全员禁言
zh_hant: 當前房間已開啟全員禁言

source: Allow viewers to apply for continuous microphone
zh_hans: 允许观众申请连麦
zh_hant: 允許觀眾申請連麥

source: Already on the seat
zh_hans: 已经处于麦上状态
zh_hant: 已經處於麥上狀態

source: Already on the seat queue
zh_hans: 已经处于排麦状态
zh_hant: 已經處於排麥狀態

source: Anchor
zh_hans: 主播
zh_hant: 主播

source: animation is not MP4 resource file
zh_hans: 礼物动画不是MP4资源
zh_hant: 禮物動畫不是MP4資源

source: animation is not svga resource file
zh_hans: 礼物动画不是SVGA资源
zh_hant: 禮物動畫不是SVGA資源

source: Application List (xxx)
zh_hans: 申请列表 (xxx)
zh_hant: 申請列表 (xxx)

source: Apply for audio link
zh_hans: 申请语音连麦
zh_hant: 申請語音連麥

source: Apply for link mic
zh_hans: 申请连麦
zh_hant: 申請連麥

source: Apply for video link
zh_hans: 申请视频连麦
zh_hant: 申請視頻連麥

source: Are you sure you want to delete xxx?
zh_hans: 确定要删除xxx吗？
zh_hant: 確定要刪除xxx嗎？

source: Are you sure you want to disconnect from other streamers?
zh_hans: 确定要断开与其他主播的连线吗?
zh_hant: 確定要斷開與其他主播的連線嗎?

source: Are you sure you want to disconnect xxx?
zh_hans: 确定要断开xxx的连麦吗？
zh_hant: 確定要斷開xxx的連麥嗎？

source: Are you sure you want to disconnect?
zh_hans: 确定要断开连麦吗？
zh_hant: 確定要斷開連麥嗎？

source: Are you sure you want to end the battle? The current result will be the final result after the end
zh_hans: 确定要结束PK吗？结束后将以当前结果为最终结果
zh_hant: 確定要結束PK嗎？結束後將以當前結果為最終結果

source: Are you sure you want to remove xxx?
zh_hans: 确定要移除xxx吗？
zh_hant: 確定要移除xxx嗎？

source: Audio
zh_hans: 音效
zh_hant: 音效

source: Audio Information
zh_hans: 音频信息
zh_hant: 音頻信息

source: Audio settings
zh_hans: 音频设置
zh_hant: 音頻設置

source: Background
zh_hans: 背景
zh_hant: 背景

source: Balance xxx
zh_hans: 余额 xxx

source: Battle request has been timeout
zh_hans: PK邀请已超时
zh_hant: PK邀請已超時

source: Beauty
zh_hans: 美颜
zh_hant: 美顏

source: Bitrate
zh_hans: 码率
zh_hant: 碼率

source: Broadcast has been ended
zh_hans: 直播已结束
zh_hant: 直播已結束

source: Camera has No System Authorization, Check System Authorization
zh_hans: 摄像头没有系统授权, 检查系统授权
zh_hant: 攝像頭沒有系統授權, 檢查系統授權

source: Camera is Occupied, Check if Other Process is Using Camera
zh_hans: 摄像头被占用，检查是否有其他进程使用摄像头
zh_hant: 攝像頭被佔用，檢查是否有其他進程使用攝像頭

source: Cancel
zh_hans: 取消
zh_hant: 取消

source: Cancel application for link mic
zh_hans: 取消连麦申请
zh_hant: 取消連麥申請

source: Cheerful
zh_hans: 欢快
zh_hant: 歡快

source: Choose Link Mode
zh_hans: 选择连麦方式
zh_hant: 選擇連麥方式

source: Choose Music
zh_hans: 选择音乐
zh_hant: 選擇音樂

source: Clarity
zh_hans: 清晰度
zh_hant: 清晰度

source: Close
zh_hans: 关闭
zh_hant: 關閉

source: Co-host
zh_hans: 连主播

source: Confirm
zh_hans: 确认
zh_hant: 確認

source: connect upon host's approval
zh_hans: 选择连麦方式，主播同意后接通
zh_hant: 選擇連麥方式，主播同意後接通

source: Connecting
zh_hans: 连线中
zh_hant: 連線中

source: Connection application has been rejected
zh_hans: 连线申请被拒绝
zh_hant: 連線申請被拒絕

source: Cover
zh_hans: 封面
zh_hant: 封面

source: creating battles too frequently. Wait a moment and try again
zh_hans: 短时间内频繁发起 battle, 稍等一会再试
zh_hant: 短時間內頻繁發起 battle, 稍等一會再試

source: creating connections too frequent in a short time. Wait a moment and try again
zh_hans: 短时间内连线过于频繁，稍等一会再试
zh_hant: 短時間內連線過於頻繁，稍等一會再試

source: Creating rooms exceeds the frequency limit, the same room ID can only be created once within 1 second
zh_hans: 频率超过限制，例如创建房间超过频率超限，同一房间 ID， 1秒内只能创建一次
zh_hant: 頻率超過限制，例如創建房間超過頻率超限，同一房間 ID， 1秒內只能創建一次

source: Current Mic (xxx/yyy)
zh_hans: 当前麦位 (xxx/yyy)
zh_hant: 當前麥位 (xxx/yyy)

source: Current Seat Audio is Locked
zh_hans: 当前麦位音频被锁
zh_hant: 當前麥位音頻被鎖

source: Current Seat Video is Locked, Need Room Owner to Unlock Mic Seat Before Opening Camera
zh_hans: 当前麦位视频被锁, 需要由房主解锁麦位后，才能打开摄像头
zh_hant: 當前麥位視頻被鎖, 需要由房主解鎖麥位後，才能打開攝像頭

source: Daily chat
zh_hans: 日常聊天
zh_hant: 日常聊天

source: Dashboard
zh_hans: 仪表盘
zh_hant: 儀錶盤

source: Disable Audio
zh_hans: 禁用音频
zh_hant: 禁用音頻

source: Disable Chat
zh_hans: 禁言
zh_hant: 禁言

source: Disable Video
zh_hans: 禁用视频
zh_hant: 禁用視頻

source: Disconnect
zh_hans: 断开连线
zh_hant: 斷開連線

source: Done
zh_hans: 完成
zh_hant: 完成

source: DownLoss
zh_hans: 下行丢包率
zh_hant: 下行丟包率

source: Duration
zh_hans: 直播时长
zh_hant: 直播時長

source: Ear Monitor
zh_hans: 耳返
zh_hant: 耳返

source: Ear Monitor Volume
zh_hans: 耳返音量
zh_hant: 耳返音量

source: Enable Audio
zh_hans: 启用音频
zh_hant: 啟用音頻

source: Enable Chat
zh_hans: 解除禁言
zh_hant: 解除禁言

source: Enable Video
zh_hans: 启用视频
zh_hant: 啟用視頻

source: End
zh_hans: 挂断
zh_hant: 掛斷

source: End Co-guest
zh_hans: 断开连麦
zh_hant: 斷開連麥

source: End Co-host
zh_hans: 断开连线

source: End Link
zh_hans: 结束连麦
zh_hant: 結束連麥

source: End Live
zh_hans: 关闭直播间
zh_hant: 關閉直播間

source: End PK
zh_hans: 结束PK
zh_hant: 結束PK

source: Entered room
zh_hans: 进入房间
zh_hant: 進入房間

source: Ethereal
zh_hans: 空灵
zh_hant: 空靈

source: Exceeds the upper limit, for example, the number of microphone seats, the number of PK match rooms, etc., exceeds the payment limit
zh_hans: 超过付费上限，例如麦位数，pk场次房间数量等超过付费限制
zh_hant: 超過付費上限，例如麥位數，pk場次房間數量等超過付費限制

source: Exit Live
zh_hans: 退出直播间
zh_hant: 退出直播間

source: Failed to Enable Screen Sharing, Check if Someone is Already Screen Sharing in the Room
zh_hans: 开启屏幕分享失败，检查房间内是否有人正在屏幕分享
zh_hant: 開啟屏幕分享失敗，檢查房間內是否有人正在屏幕分享

source: Failed to enter room
zh_hans: 进房失败
zh_hant: 進房失敗

source: Failed to get screen sharing source (screen and window), check screen recording permissions
zh_hans: 获取屏幕分享源（屏幕和窗口）失败，检查屏幕录制权限
zh_hant: 獲取屏幕分享源（屏幕和窗口）失敗，檢查屏幕錄製權限

source: Failed to Obtain Permission, Unauthorized Audio/Video Permission, Please Check if Device Permission is Enabled
zh_hans: 获取权限失败，当前未授权音/视频权限，请查看是否开启设备权限
zh_hant: 獲取權限失敗，當前未授權音/視頻權限，請查看是否開啟設備權限

source: Filters
zh_hans: 滤镜
zh_hant: 濾鏡

source: Flip
zh_hans: 翻转
zh_hant: 翻轉

source: Follow
zh_hans: 关注
zh_hant: 關注

source: FPS
zh_hans: 帧率
zh_hant: 幀率

source: Gift
zh_hans: 礼物
zh_hant: 禮物

source: Gift givers
zh_hans: 送礼人数
zh_hant: 送禮人數

source: Gift Income
zh_hans: 礼物收入
zh_hant: 禮物收入

source: Go live
zh_hans: 开始直播

source: Hang Up
zh_hans: 挂断
zh_hant: 掛斷

source: Illegal Custom Room ID, Must Be Printable ASCII Characters (0x20-0x7e), Up to 48 Bytes Long
zh_hans: 创建房间 ID 非法，自定义 ID 必须为可打印 ASCII 字符（0x20-0x7e），最长48个字节
zh_hant: 創建房間 ID 非法，自定義 ID 必須為可列印 ASCII 字符（0x20-0x7e），最長48個字節

source: Illegal Room Name, Maximum 30 Bytes, Must Be UTF-8 Encoding if Contains Chinese Characters
zh_hans: 房间名称非法，名称最长30字节，字符编码必须是 UTF-8 ，如果包含中文
zh_hant: 房間名稱非法，名稱最長30位元組，字符編碼必須是 UTF-8 ，如果包含中文

source: Insufficient balance, please recharge.
zh_hans: 余额不足，请充值

source: Internal error, it is recommended to try again.
zh_hans: 内部错误，推荐重试一次。
zh_hant: 內部錯誤，推薦重試一次。

source: Invalid room type
zh_hans: 无效的房间类型
zh_hant: 無效的房間類型

source: Invalid userId
zh_hans: 非法的userId
zh_hant: 非法的userId

source: Invite
zh_hans: 邀请
zh_hant: 邀請

source: It's live, please try again later.
zh_hans: 正在直播中，请稍后再试。

source: It's not allowed to cancel battle for room in battle
zh_hans: 该房间处于 battle 中
zh_hant: 該房間處於 battle 中

source: Kicked out of seat by room owner
zh_hans: 被主持人踢下麦位
zh_hant: 被主持人踢下麥位

source: Knowledge Teaching
zh_hans: 知识教学
zh_hant: 知識教學

source: Likes
zh_hans: 点赞

source: Link Application(xxx)
zh_hans: 申请连麦(xxx)
zh_hant: 申請連麥(xxx)

source: Link Management
zh_hans: 连麦管理
zh_hant: 連麥管理

source: Live broadcast has ended
zh_hans: 直播已结束
zh_hant: 直播已結束

source: Live Category:xxx
zh_hans: 直播分类:xxx
zh_hant: 直播分類:xxx

source: Live data
zh_hans: 本场直播数据
zh_hant: 本場直播數據

source: Live Mode:xxx
zh_hans: 直播模式:xxx
zh_hant: 直播模式:xxx

source: Live Room ID: xxx
zh_hans: 直播房间ID：xxx
zh_hant: 直播房間ID：xxx

source: Live Video
zh_hans: 视频直播
zh_hant: 視頻直播

source: Loading more
zh_hans: 加载更多
zh_hant: 加載更多

source: Loading...
zh_hans: 正在加载...

source: Local User
zh_hans: 本地用户
zh_hant: 本地用戶

source: Lock Seat
zh_hans: 锁定麦位
zh_hant: 鎖定麥位

source: Loli
zh_hans: 萝莉
zh_hant: 蘿莉

source: Loud
zh_hans: 洪亮
zh_hant: 洪亮

source: Low
zh_hans: 低沉
zh_hant: 低沉

source: Magical World
zh_hans: 神奇世界
zh_hant: 神奇世界

source: Makeup
zh_hans: 美妆
zh_hant: 美妝

source: Maximum Seat Exceeds Package Quantity Limit
zh_hans: 最大麦位超出套餐包数量限制
zh_hant: 最大麥位超出套餐包數量限制

source: Me
zh_hans: 我
zh_hant: 我

source: Melancholy
zh_hans: 忧郁
zh_hant: 憂鬱

source: Messages
zh_hans: 消息数量
zh_hant: 消息數量

source: Metallic sound
zh_hans: 金属声
zh_hant: 金屬聲

source: Mic has No System Authorization, Check System Authorization
zh_hans: 麦克风没有系统授权，检查系统授权
zh_hant: 麥克風沒有系統授權，檢查系統授權

source: Mic is Occupied
zh_hans: 麦克风被占用
zh_hant: 麥克風被佔用

source: Microdermabrasion
zh_hans: 磨皮
zh_hant: 磨皮

source: Mirror
zh_hans: 镜像
zh_hant: 鏡像

source: Modify the cover
zh_hans: 修改封面
zh_hant: 修改封面

source: More settings
zh_hans: 更多设置
zh_hant: 更多設置

source: Music
zh_hans: 音乐
zh_hant: 音樂

source: Music Pitch
zh_hans: 音乐升降调
zh_hant: 音樂升降調

source: Music play error
zh_hans: 音乐播放失败
zh_hant: 音樂播放失敗

source: Music volume
zh_hans: 音乐音量
zh_hant: 音樂音量

source: Mute
zh_hans: 静音
zh_hant: 靜音

source: Naughty child
zh_hans: 熊孩子
zh_hant: 熊孩子

source: Need to Apply to Room Owner or Administrator to Open Camera
zh_hans: 需要向房主或管理员申请后打开摄像头
zh_hant: 需要向房主或管理員申請後打開攝像頭

source: Need to Apply to Room Owner or Administrator to Open Mic
zh_hans: 需要向房主或管理员申请后打开麦克风
zh_hant: 需要向房主或管理員申請後打開麥克風

source: No Camera Device Currently, Please Insert Camera Device to Solve the Problem
zh_hans: 当前无摄像头设备，请插入摄像头设备解决该问题
zh_hant: 當前無攝像頭設備，請插入攝像頭設備解決該問題

source: No effect
zh_hans: 无效果
zh_hant: 無效果

source: No Mic Device Currently
zh_hans: 当前无麦克风设备
zh_hant: 當前無麥克風設備

source: No payment information, you need to purchase a package in the console
zh_hans: 无付费信息，需在控制台购买套餐包
zh_hant: 無付費信息，需在控制臺購買套餐包

source: No Permission for Signaling Request, e.g. Canceling an Invite Not Initiated by Yourself
zh_hans: 信令请求无权限，例如取消非自己发起的邀请
zh_hant: 信令請求無權限，例如取消非自己發起的邀請

source: No users in the seat, go to invite
zh_hans: 麦位没有用户，去邀请
zh_hant: 麥位沒有用戶，去邀請

source: None of the rooms in the battle is valid
zh_hans: 发起的 battle 里没有一个有效的房间
zh_hant: 發起的 battle 裡沒有一個有效的房間

source: Not a room member
zh_hans: 非房间成员
zh_hant: 非房間成員

source: Not Found SDKAppID, Please Confirm Application Info in TRTC Console
zh_hans: 未找到 SDKAppID，请在 腾讯云视立方 SDK 控制台 确认应用信息
zh_hant: 未找到 SDKAppID，請在 騰訊雲視立方 SDK 控制臺 確認應用信息

source: Not Logged In, Please Call Login API
zh_hans: 未登录,请调用 Login 接口
zh_hant: 未登錄,請調用 Login 接口

source: Not on the seat
zh_hans: 未在麦上
zh_hant: 未在麥上

source: Not on the seat queue
zh_hans: 没有在排麦列表中
zh_hant: 沒有在排麥列表中

source: On Seat List (xxx)
zh_hans: 麦上列表 (xxx)
zh_hant: 麥上列表 (xxx)

source: One-click beauty
zh_hans: 一键美颜
zh_hant: 一鍵美顏

source: Online audience
zh_hans: 在线观众
zh_hant: 在線觀眾

source: Operation Successful
zh_hans: 操作成功
zh_hant: 操作成功

source: Original
zh_hans: 原声
zh_hant: 原聲

source: Passing illegal parameters when calling API, check if the parameters are legal
zh_hans: 调用 API 时，传入的参数不合法，检查入参是否合法
zh_hant: 調用 API 時，傳入的參數不合法，檢查入參是否合法

source: PK End
zh_hans: PK结束
zh_hant: PK結束

source: Please enter room name
zh_hans: 请输入房间名
zh_hant: 請輸入房間名

source: Privacy
zh_hans: 隐私
zh_hant: 隱私

source: Public
zh_hans: 公开
zh_hant: 公開

source: Pull to refresh
zh_hans: 下拉刷新
zh_hant: 下拉刷新

source: Recharge
zh_hans: 充值
zh_hant: 充值

source: Reject
zh_hans: 拒绝
zh_hant: 拒絕

source: Release to refresh
zh_hans: 松开刷新
zh_hant: 鬆開刷新

source: Remote User
zh_hans: 远端用户
zh_hant: 遠端用戶

source: Remove
zh_hans: 移除
zh_hant: 移除

source: Remove Out
zh_hans: 移出房间
zh_hant: 移出房間

source: Repeat Operation
zh_hans: 重复操作
zh_hant: 重複操作

source: Request Rate Limited, Please Try Again Later
zh_hans: 请求被限频，请稍后重试
zh_hant: 請求被限頻，請稍後重試

source: Require owner's consent to speak
zh_hans: 上麦需要房主同意
zh_hant: 上麥需要房主同意

source: Resolution
zh_hans: 分辨率
zh_hant: 解析度

source: Reverb
zh_hans: 混响
zh_hant: 混響

source: Room Entry Password Error
zh_hans: 进房密码错误
zh_hant: 進房密碼錯誤

source: Room Owner Does Not Support Leaving the Room, Room Owner Can Only Close the Room
zh_hans: 房主不支持退房操作，房主只能解散房间
zh_hant: 房主不支持退房操作，房主只能解散房間

source: Room Owner or Administrator Permission Required for Operation
zh_hans: 需要房主或者管理员权限才能操作
zh_hant: 需要房主或者管理員權限才能操作

source: Room Owner Permission Required for Operation
zh_hans: 需要房主权限才能操作
zh_hant: 需要房主權限才能操作

source: Rosy
zh_hans: 红润
zh_hant: 紅潤

source: RTT
zh_hans: 往返延时
zh_hant: 往返延時

source: Sample Rate
zh_hans: 采样率
zh_hant: 採樣率

source: Say something...
zh_hans: 说点什么…

source: Screen sharing needs to be enabled after applying to the room owner or administrator
zh_hans: 需要向房主或管理员申请后打开屏幕分享
zh_hant: 需要向房主或管理員申請後打開屏幕分享

source: Seat invitation has been canceled
zh_hans: 上麦邀请已被取消
zh_hant: 上麥邀請已被取消

source: Seat Serial Number Does Not Exist
zh_hans: 麦位编号不存在
zh_hant: 麥位編號不存在

source: Send
zh_hans: 发送
zh_hant: 發送

source: Send Out
zh_hans: 赠送
zh_hant: 贈送

source: Sensitive words are detected, please modify it and try again
zh_hans: 检测到敏感词，请修改后重试
zh_hant: 檢測到敏感詞，請修改後重試

source: Sent
zh_hans: 送给
zh_hant: 送給

source: Server internal error, please retry
zh_hans: 服务器内部错误，请重试
zh_hant: 伺服器內部錯誤，請重試

source: Set as background
zh_hans: 设为背景
zh_hant: 設為背景

source: Set as cover
zh_hans: 设为封面
zh_hant: 設為封面

source: Settings
zh_hans: 设置
zh_hant: 設置

source: Shopping
zh_hans: 购物
zh_hant: 購物

source: Signal request conflict
zh_hans: 信令请求冲突
zh_hant: 信令請求衝突

source: Signal request repetition
zh_hans: 信令请求重复
zh_hant: 信令請求重複

source: Signaling Request ID is Invalid or Has Been Processed
zh_hans: 信令请求 ID 无效或已经被处理过
zh_hant: 信令請求 ID 無效或已經被處理過

source: Start Video
zh_hans: 开启视频
zh_hant: 開啟視頻

source: Stop Video
zh_hans: 关闭视频
zh_hant: 關閉視頻

source: Suggested Hosts
zh_hans: 推荐列表
zh_hant: 推薦列表

source: Switch to Landscape
zh_hans: 切换至横屏
zh_hant: 切換至橫屏

source: Switch to Portrait
zh_hans: 切换至竖屏
zh_hant: 切換至豎屏

source: System Issue, Failed to Open Camera. Check if Camera Device is Normal
zh_hans: 系统问题，打开摄像头失败。检查摄像头设备是否正常
zh_hant: 系統問題，打開攝像頭失敗。檢查攝像頭設備是否正常

source: System Issue, Failed to Open Mic. Check if Mic Device is Normal
zh_hans: 系统问题，打开麦克风失败。检查麦克风设备是否正常
zh_hant: 系統問題，打開麥克風失敗。檢查麥克風設備是否正常

source: Tag quantity Exceeds Upper limit
zh_hans: 标签数量超上限
zh_hant: 標籤數量超上限

source: Take Seat
zh_hans: 上麦
zh_hant: 上麥

source: Take seat application has been rejected
zh_hans: 上麦申请被拒绝
zh_hant: 上麥申請被拒絕

source: Take seat application timeout
zh_hans: 上麦申请超时
zh_hant: 上麥申請超時

source: Temporarily Unclassified General Error
zh_hans: 暂未归类的通用错误
zh_hant: 暫未歸類的通用錯誤

source: The admin quantity exceeds the upper limit
zh_hans: 管理员数量超过上限
zh_hant: 管理員數量超過上限

source: The anchor disabled your video
zh_hans: 您已被主播关闭摄像头
zh_hant: 您已被主播關閉攝像頭

source: The anchor enabled your video
zh_hans: 主播解禁了你的摄像头
zh_hant: 主播解禁了你的攝像頭

source: The anchor has muted you
zh_hans: 您已被主播静音
zh_hant: 您已被主播靜音

source: The anchor has unmuted you
zh_hans: 主播解除了您的静音
zh_hant: 主播解除了您的靜音

source: The anchor is in the battle and cannot initiate the battle
zh_hans: 主播正在PK中，无法发起PK
zh_hant: 主播正在PK中，無法發起PK

source: The battle does not exist or has ended
zh_hans: 该场次 battle 不存在或已结束
zh_hant: 該場次 battle 不存在或已結束

source: The battle has not started yet
zh_hans: 该 battle 场次还未开始
zh_hant: 該 battle 場次還未開始

source: The battle session has ended
zh_hans: 该 battle 场次已经结束
zh_hant: 該 battle 場次已經結束

source: The content is too long, please reduce the content and try again
zh_hans: 内容太长，请缩减内容后再试
zh_hant: 內容太長，請縮減內容後再試

source: The current connection does not exist or has ended
zh_hans: 当前连线不存在或结束
zh_hant: 當前連線不存在或結束

source: The current microphone position video is locked and needs to be unlocked by the room owner before screen sharing can be enabled
zh_hans: 当前麦位视频被锁, 需要由房主解锁麦位后，才能打开屏幕分享
zh_hant: 當前麥位視頻被鎖, 需要由房主解鎖麥位後，才能打開屏幕分享

source: The current room does not support preloading
zh_hans: 当前房间不支持预加载
zh_hant: 當前房間不支持預加載

source: The current room is connecting with other rooms
zh_hans: 当前房间与其他房间连线中
zh_hant: 當前房間與其他房間連線中

source: The current room requires a password for entry
zh_hans: 当前房间需要密码才能进入
zh_hant: 當前房間需要密碼才能進入

source: The current seat is already occupied
zh_hans: 当前麦位已经有人了
zh_hant: 當前麥位已經有人了

source: The network is abnormal, please try again later
zh_hans: 网络异常，请稍后再试
zh_hant: 網絡異常，請稍後再試

source: The number of co-hosting has exceeded the maximum limit.
zh_hans: 当前连线人数已达最大限制。
zh_hant: 當前連線人數已達最大限制。

source: The number of keys in the room's Metadata exceeds the limit
zh_hans: 房间 meta 数据中的 key 数量超过上限
zh_hant: 房間 meta 數據中的 key 數量超過上限

source: The other error, cannot initiate the battle
zh_hans: 其他错误，无法发起PK
zh_hant: 其他錯誤，無法發起PK

source: The parameter is illegal. Check whether the request is correct according to the error description
zh_hans: 请参数非法，请根据错误描述检查请求是否正确
zh_hant: 請參數非法，請根據錯誤描述檢查請求是否正確

source: The room does not exist, or it once existed but has now been dissolved
zh_hans: 房间不存在，或者曾经存在过，但是目前已经被解散
zh_hant: 房間不存在，或者曾經存在過，但是目前已經被解散

source: The room does not support seat ability
zh_hans: 该房间不支持连麦
zh_hant: 該房間不支持連麥

source: The room ID already exists. Please select another room ID
zh_hans: 房间ID 已被使用，请选择别的房间ID
zh_hant: 房間ID 已被使用，請選擇別的房間ID

source: The room ID has been occupied by Chat. You can use a different room ID or dissolve the group first
zh_hans: 房间 ID 已被 IM 占用，可以换一个房间 ID 使用，或者先通过 IM 接口解散该群
zh_hant: 房間 ID 已被 IM 佔用，可以換一個房間 ID 使用，或者先通過 IM 接口解散該群

source: The room ID has been used, and the operator is the room owner, it can be used directly
zh_hans: 房间 ID 已被使用，并且操作者为房主，可以直接使用
zh_hant: 房間 ID 已被使用，並且操作者為房主，可以直接使用

source: The room is already in connection
zh_hans: 该房间已经在连线中
zh_hant: 該房間已經在連線中

source: The room is already in other battle
zh_hans: 该房间处于其他的 battle 场次中
zh_hant: 該房間處於其他的 battle 場次中

source: The room is full
zh_hans: 房间成员已满
zh_hant: 房間成員已滿

source: The room isn‘t in the battle
zh_hans: 该房间已经不在 battle 中
zh_hant: 該房間已經不在 battle 中

source: The room number has exceeded the limit in connection or battle
zh_hans: 超过连线和 battle 房间数量上限
zh_hant: 超過連線和 battle 房間數量上限

source: The room you are invited to connect to does not exist
zh_hans: 邀请连线的房间不存在
zh_hant: 邀請連線的房間不存在

source: The room you are invited to connect to is already in the invitation list or is already connected.
zh_hans: 被邀请连线的房间已在邀请列表或者已连线。
zh_hant: 被邀請連線的房間已在邀請列表或者已連線。

source: The room you are invited to connect to is connected to another room.
zh_hans: 被邀请连线的房间与其他房间连线中。
zh_hant: 被邀請連線的房間與其他房間連線中。

source: The screen effect will automatically take effect after connecting
zh_hans: 接通后画面效果将自动生效
zh_hant: 接通後畫面效果將自動生效

source: The seat is locked. You can try another seat
zh_hans: 麦位已锁定，可以尝试换一个麦位
zh_hant: 麥位已鎖定，可以嘗試換一個麥位

source: The seat list is empty
zh_hans: 连麦列表为空
zh_hant: 連麥列表為空

source: The seats are all taken.
zh_hans: 麦位已满
zh_hant: 麥位已滿

source: The size of key in the room's Metadata exceeds the maximum byte limit
zh_hans: 房间 meta 数据中的 key 大小超过了最大字节数限制
zh_hant: 房間 meta 數據中的 key 大小超過了最大字節數限制

source: The size of value in the room's Metadata exceeds the maximum byte limit
zh_hans: 房间 meta 数据中单个 key 对应的 val 超过最大字节数限制
zh_hant: 房間 meta 數據中單個 key 對應的 val 超過最大字節數限制

source: The total size of all value in the room's Metadata exceeds the maximum byte limit
zh_hans: 房间 meta数据中所有 key 对应的 val 总和超过最大字节数限制
zh_hant: 房間 meta數據中所有 key 對應的 val 總和超過最大字節數限制

source: The user is already on the seat
zh_hans: 已经有用户在麦位上
zh_hant: 已經有用戶在麥位上

source: There is a pending battle request for this room
zh_hans: 该房间存在待处理的 battle 请求
zh_hant: 該房間存在待處理的 battle 請求

source: There is a pending connection request for this room
zh_hans: 该房间存在待处理的连线请求
zh_hant: 該房間存在待處理的連線請求

source: There is no more data
zh_hans: 没有更多数据了

source: There is no valid keys when delete metadata
zh_hans: 删除房间 meta 数据时候，被删除的 key 没有一个存在
zh_hant: 刪除房間 meta 數據時候，被刪除的 key 沒有一個存在

source: This Feature Can Only Be Used After Entering the Room
zh_hans: 需要进房后才可使用此功能
zh_hant: 需要進房後才可使用此功能

source: This feature requires an additional package. Please activate the corresponding package as needed in the TRTC Console
zh_hans: 该功能需要开通额外的套餐，请在 腾讯云视立方 SDK 控制台 按需开通对应套餐
zh_hant: 該功能需要開通額外的套餐，請在 騰訊雲視立方 SDK 控制臺 按需開通對應套餐

source: This member has been banned
zh_hans: 该成员已经被封禁
zh_hant: 該成員已經被封禁

source: This member has been muted
zh_hans: 该成员已经被禁言
zh_hant: 該成員已經被禁言

source: This Operation is Not Supported in the Current Room Type
zh_hans: 当前房间类型下不支持该操作
zh_hant: 當前房間類型下不支持該操作

source: Total Views
zh_hans: 累计观看
zh_hant: 累計觀看

source: turn off
zh_hans: 关闭
zh_hant: 關閉

source: Ultimate-Video
zh_hans: 至臻画质
zh_hant: 至臻畫質

source: Uncle
zh_hans: 大叔
zh_hant: 大叔

source: Unfollow
zh_hans: 取消关注
zh_hant: 取消關注

source: Unlock Seat
zh_hans: 解锁麦位
zh_hant: 解鎖麥位

source: Unmute
zh_hans: 解除静音
zh_hant: 解除靜音

source: UpLoss
zh_hans: 上行丢包率
zh_hant: 上行丟包率

source: User is Already in Another Room, Single RoomEngine Instance Only Supports User Entering One Room, To Enter Different Room, Please Leave the Room or Use New RoomEngine Instance
zh_hans: 当前用户已在别的房间内，单个 roomEngine 实例只支持用户进入一个房间，如果要进入不同的房间请先退房或者使用新的 roomEngine 实例
zh_hant: 當前用戶已在別的房間內，單個 roomEngine 實例只支持用戶進入一個房間，如果要進入不同的房間請先退房或者使用新的 roomEngine 實例

source: User is not exist
zh_hans: 用户不存在
zh_hant: 用戶不存在

source: Video
zh_hans: 视频参数
zh_hant: 視頻參數

source: Video Config
zh_hans: 视频参数
zh_hant: 視頻參數

source: Video Information
zh_hans: 视频信息
zh_hant: 視頻信息

source: Video Resolution
zh_hans: 视频分辨率
zh_hant: 視頻解析度

source: Voice changer
zh_hans: 变声
zh_hant: 變聲

source: Voice volume
zh_hans: 人声音量
zh_hant: 人聲音量

source: Waiting
zh_hans: 邀请中
zh_hant: 邀請中

source: Waiting for battlexxx
zh_hans: 等待同意PKxxx
zh_hant: 等待同意PKxxx

source: Waiting for link xxx
zh_hans: 等待连麦 xxx
zh_hant: 等待連麥 xxx

source: Waitingxxx
zh_hans: 待通过xxx
zh_hant: 待通過xxx

source: Warm Tips
zh_hans: 温馨提示
zh_hant: 溫馨提示

source: Whitening
zh_hans: 美白
zh_hant: 美白

source: xxx canceled battle, please try to initiate it again
zh_hans: xxx 取消了 PK，请尝试再次发起
zh_hant: xxx 取消了 PK，請嘗試再次發起

source: xxx Fans
zh_hans: xxx 粉丝
zh_hant: xxx 粉絲

source: xxx invite you to battle together
zh_hans: xxx 向你发来PK邀请
zh_hant: xxx 向你發來PK邀請

source: xxx invite you to host together
zh_hans: xxx 向你发来连线邀请
zh_hant: xxx 向你發來連線邀請

source: xxx invites you to take seat
zh_hans: xxx 向你发来上麦邀请
zh_hant: xxx 向你發來上麥邀請

source: xxx people viewed
zh_hans: xxx人看过

source: xxx rejected battle
zh_hans: xxx 拒绝了 PK
zh_hant: xxx 拒絕了 PK

source: You are currently co-guesting with other streamers. Would you like to [End Co-guest] or [Exit Live] ?
zh_hans: 当前处于连麦状态，是否需要「断开连麦」或「退出直播间」

source: You are currently co-guesting with other streamers. Would you like to [End Live] ?
zh_hans: 当前处于连麦状态，是否需要「关闭直播间」
zh_hant: 當前處於連麥狀態，是否需要「關閉直播間」

source: You are currently co-hosting with other streamers. Would you like to [End Co-host] or [End Live] ?
zh_hans: 当前处于连线状态，是否需要「断开连线」或「关闭直播间」
zh_hant: 當前處於連線狀態，是否需要「斷開連線」或「關閉直播間」

source: You are currently in PK mode. Would you like to [End PK] or [End Live] ?
zh_hans: 当前处于PK状态，是否需要「断开PK」或「关闭直播间」
zh_hant: 當前處於PK狀態，是否需要「結束PK」或「關閉直播間」

source: You do not have permission to perform this operation
zh_hans: 您无权执行此操作
zh_hant: 您無權執行此操作

source: You have been kicked out of the room by the anchor
zh_hans: 您已被主播踢出房间
zh_hant: 您已被主播踢出房間

source: You have been muted in the current room
zh_hans: 当前房间内，您已被禁言
zh_hant: 當前房間內，您已被禁言

source: You Have Been Muted in the Current Room
zh_hans: 当前房间内，您已被禁言
zh_hant: 當前房間內，您已被禁言

source: You have been muted in the current room and cannot send gifts
zh_hans: 当前房间内您已被禁言，无法发送礼物
zh_hant: 當前房間內您已被禁言，無法發送禮物

source: You have been unmuted in the current room
zh_hans: 当前房间内，您已被解除禁言
zh_hant: 當前房間內，您已被解除禁言

source: You have submitted a link mic request, please wait for the author approval
zh_hans: 你提交了连麦申请，请等待主播同意
zh_hant: 你提交了連麥申請，請等待主播同意

source: Logged In
zh_hans: 登录成功
zh_hant: 登錄成功

source: Likes Count
zh_hans: 点赞数量
zh_hant: 點讚數量

source: Start Co-hosting
zh_hans: 发起连线
zh_hant: 發起連線

source: Login failed
zh_hans: 登录失败
zh_hant: 登錄失敗

source: Other errors, cannot connect.
zh_hans: 其他错误，无法发起连线
zh_hant: 其他錯誤，無法發起連線

source: Audio Bitrate
zh_hans: 音频码率

source: Media Information
zh_hans: 音视频信息

source: Network Information
zh_hans: 网络信息

source: More Features
zh_hans: 更多功能
zh_hant: 更多功能

source: Please start a live room
zh_hans: 请先开启一个直播间

source: Requesting(xxx)
zh_hans: 申请连麦(xxx)
zh_hant: 申請連麥(xxx)
